# config.py

# 配置参数
CONFIG = {
    # LS配置参数

    # 定义考虑的产品
    "materials": ["A", "B", "C", "D", "E"],

    # 定义每种产品在优化周期开始时的库存量
    "initial_inventories": {"A": 1000,
                            "B": 1000,
                            "C": 100,
                            "D": 0,
                            "E": 0},

    # 定义每天结束时各个产品的需求量
    "demand_matrix": [0, 0, 3, 2, 1],
                      

    # 定义一个n×1矩阵，代表每个产品的均价
    "price_matrix": [10, 20, 30, 40, 50],

    # 定义一个5x5的关系矩阵
    "relationship_matrix": [[0,     0,   0.8,  0,   0  ],
                            [0,     0,   0.4,  0.3, 0.5],
                            [-0.8, -0.4, 0,    0.8, 0.7],
                            [0,    -0.3, -0.8, 0,   0  ],
                            [0,    -0.5, -0.7, 0,   0  ]]
} 